InformationRegisters/КлассПрофессиональногоРискаИСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КлассПрофессиональногоРискаИСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлассПрофессиональногоРиска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлассПрофессиональногоРискаИСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает класс профессионального риска, соответствующий ставке взноса.
//
// Параметры:
//  Ставка - Число
//  Дата - Дата
// 
// Возвращаемое значение:
//  Число
//
Функция КлассПрофессиональногоРиска(Ставка, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ставка", Ставка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассПрофРискаИСтавкаВзноса.КлассПрофессиональногоРиска КАК КлассПрофессиональногоРиска
	|ИЗ
	|	РегистрСведений.КлассПрофессиональногоРискаИСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(&Дата, ) КАК КлассПрофРискаИСтавкаВзноса
	|ГДЕ
	|	КлассПрофРискаИСтавкаВзноса.Ставка = &Ставка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	КлассПрофессиональногоРиска = Неопределено;
	Если Выборка.Следующий() Тогда
		КлассПрофессиональногоРиска = Выборка.КлассПрофессиональногоРиска;
	КонецЕсли;
	
	Возврат КлассПрофессиональногоРиска;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение и обновление информационной базы.
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст());
КонецПроцедуры

// Обновляет данные регистра.
//
// Параметры:
//  ТекстXML - Строка
//
Процедура Обновить(ТекстXML) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ЗагружаемыеСведения = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстXML);
	НаборЗаписей.Загрузить(ЗагружаемыеСведения.Данные);
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
